books/books.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-14 Thu 21:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Books</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Henry Robinson" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Books</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6b5e833">1. <b>Eleanor Oliphant is Completely Fine</b></a></li>
<li><a href="#orgf274680">2. <b>Hunger Makes Me a Modern Girl</b> - <span class="underline">Carrie Brownstein</span></a></li>
<li><a href="#orgb75c23c">3. <b>Where'd You Go, Bernadette?</b></a></li>
<li><a href="#org5c722a0">4. <b>Normal People</b> - <span class="underline">Sally Rooney</span></a></li>
<li><a href="#orgf979017">5. <b>Fleischman Is In Trouble</b> - <span class="underline">Taffy Brodesser-Akner</span></a></li>
<li><a href="#org65c2c27">6. <b>Life After Life</b> - <span class="underline">Kate Atkinson</span></a></li>
</ul>
</div>
</div>

<div id="outline-container-org6b5e833" class="outline-2">
<h2 id="org6b5e833"><span class="section-number-2">1</span> <b>Eleanor Oliphant is Completely Fine</b></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>TODO</li>
</ul>
</div>
</div>

<div id="outline-container-orgf274680" class="outline-2">
<h2 id="orgf274680"><span class="section-number-2">2</span> <b>Hunger Makes Me a Modern Girl</b> - <span class="underline">Carrie Brownstein</span></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Carrie Brownstein's memoir of the first ~20 years of Sleater-Kinney, and her formative years in
Washington and Oregon.</li>
<li>It's a slightly disappointing read, because of the remove that's kept between the author and the
reader when dealing with the most pivotal moments of the band's history. Firing a drummer is given
short-shrift, as is the final implosion (far more attention is given to CB's ailments and pets
than really interrogating the reason she blew up the band during The Woods' tour).</li>
<li>The sense you get is that certain episodes in CB's past are still to painful or uncomfortable - or
just too personal - to relate to an unknown audience. Throughout the book she writes with
intensity about the way that music mediates her relationship with her audience; the importance of
giving it your all while performing, and the degree to which she and the band didn't want to
settle into anything comfortable. The book treats its readers in the same way: distanced, at arm's
length and with a certain need-to-know reluctance.</li>
<li>It's still useful as a partial history of the band (I am ashamed to admit I didn't know that
Brownstein and Tucker had dated, although that's roughly the extent of the detail you'll find in
the book about it).</li>
</ul>
</div>
</div>

<div id="outline-container-orgb75c23c" class="outline-2">
<h2 id="orgb75c23c"><span class="section-number-2">3</span> <b>Where'd You Go, Bernadette?</b></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>TODO</li>
</ul>
</div>
</div>

<div id="outline-container-org5c722a0" class="outline-2">
<h2 id="org5c722a0"><span class="section-number-2">4</span> <b>Normal People</b> - <span class="underline">Sally Rooney</span></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>The story of the relationship between two young people in Ireland. Marianne is the daughter of
wealthy parents, but has suffered enormous emotional and physical abuse at their hands. Connell is
the son of their cleaner, and is popular at school. Both are academically gifted.</li>
<li>They develop a deep relationship at the start of the book, then fate, poor decision making, and
emotional constipation conspire to move them away from and towards each other like the tides
coming in and out.</li>
<li>She is too deeply damaged by her familial abuse to believe that she has worth and therefore
believes fundamentally that Connell cannot love her; he is unsure of her feelings for him, unable
to set aside some class anxiety.</li>
<li>The book is written as, mostly, a series of vignettes separated by periods of time (the chapters
are 'five weeks later' etc). Some are very affecting (e.g. Marianne with the Swedish photographer
who treats her roughly in bed; she is revolted when he says he loves her as she views that as
incompatible with their dynamic, she would be heartbroken to discover that was what love was).</li>
<li>The protaganists both grow and shrink as they move from school to university. They're
hyper-articulate, and a little unbelievable capable of acting with maturity in the moment (one of
them bristles, the other immediately says what they really meant, the issue doesn't linger).</li>
<li>The book has lovely passages, and is written in such a way that sometimes makes you nearly
claustrophobic inside their relationship.</li>
<li>I've heard the book dismissed as 'millenial' or 'for YA'; I don't get that at all - the challenges
of growing, knowing yourself and building your self-worth, talking frankly about your feelings,
the pain of a love that you deny yourself are all timeless topics.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf979017" class="outline-2">
<h2 id="orgf979017"><span class="section-number-2">5</span> <b>Fleischman Is In Trouble</b> - <span class="underline">Taffy Brodesser-Akner</span></h2>
</div>
<div id="outline-container-org65c2c27" class="outline-2">
<h2 id="org65c2c27"><span class="section-number-2">6</span> <b>Life After Life</b> - <span class="underline">Kate Atkinson</span></h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><p>
Ursula Todd is born, in the snow in England in 1912, and immediately dies. In the very next
chapter, she is reborn in the same circumstances, now saved by the doctor who is able to attend to
her birth. She lives longer this time; but eventually falls to her death, or is washed away in the
sea, or is killed by her lover, or bombed out in Berlin in 1945.
</p>

<p>
The novel explores paths not taken and shows how small decisions can have substantial
consequences. At the same time, some things are fixed: her mother is always the same woman,
caustic and cynical. Her younger brother's love for their next-door neighbour is a constant, even
though in one timeline she is murdered as young girl.
</p>

<p>
Gradually, as Ursula repeats her life, she begins to develop an instinct for when history is
beginning to repeat itself, and on occasion intervenes (she pushes her mother's maid down the
stairs to avoid exposure to a deadly flu). Eventually, one timeline leads her to commit suicide
after having been accepted into Hitler's inner circle - the Russians are advancing on Berlin and
she is doomed. The book says that something fractures at that point, and that things are no longer
quite the same.
</p>

<p>
Indeed, Ursula is thereafter imbued with more of a sense of purpose. She lives many more times,
perfecting her plans, able to predict where life's choices will take her, until she puts herself
in the position of being able to murder Hitler before his rise to power. In doing so, she believes
she saves her brother, Teddy, who is otherwise shot down at the end of the war.
</p>

<p>
The book saves two dramatic twists for the end, though. In the first, we see the timeline reset,
yet again - Ursula is reborn. Is she returning to the beginning? Does she still have insight into
where her choices will lead? Must she kill Hitler over and over again?
</p>

<p>
Second, the book hints strongly that her mother <span class="underline">also</span> has the gift of foresight (she eventually
prepares some scissors to save the infant Ursula). Are all the Todd women so gifted? Are they
conspiring across generations to prepare for this eventual outcome? And if so, what becomes of the
plan once the timeline is reset again, and again, and again?
</p></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Henry Robinson</p>
<p class="date">Created: 2019-11-14 Thu 21:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
